Revit 2027 API
FabricationConfiguration.LocateMaterial Method
 Gets material by group and name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LocateMaterial(
	string group,
	string name
)
Public Function LocateMaterial (
	group As String,
	name As String
) As Integer
public:
int LocateMaterial(
	String^ group,
	String^ name
)
member LocateMaterial :
        group : string *
        name : string -> int
Parameters
group String
 The material group.
name String
 The group name.
Return Value
Int32
 The material identifier. Returns -1 if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace